#!/bin/bash

echo 現在的時間是--`date +%T| sed -e 's/\(.*\):\(.*\):\(.*\)/\1-時--\2-分--\3-秒--/'` | espeak -vzh
echo 今天是--`date +%x| sed -e 's/\(.*\):\(.*\):\(.*\)/\1-月--\2-日--\3-年--/'` | espeak -vzh

echo 現在的時間是--`date +%T| sed -e 's/\(.*\):\(.*\):\(.*\)/\1-時--\2-分--\3-秒--/'`
echo 今天是--`date +%x| sed -e 's/\(.*\):\(.*\):\(.*\)/\1-月--\2-日--\3-年--/'`

#echo 現在的時間是--`date +%T| sed -e 's/\(.*\):\(.*\):\(.*\)/\1-時--\2-分--\3-秒--/'` | espeak -vzh
#echo 現在的時間是--`date +%T| sed -e 's/\(.*\):\(.*\):\(.*\)/\1-時--\2-分--\3-秒--/'`